app/Controllers/BarangController.php

    public function index()
    {
        //Ambil semua data barang dari database ke dalam variabel data
        $data = $this->barangModel->findAll();
---
SELECT *
FROM `barang`

            'jumlah'        => $this->request->getPost('jumlah')
        ];

        $this->barangModel->save($data);
---
INSERT INTO `barang` (`nama_barang`, `kategori`, `jumlah`) VALUES ('Zodiac', 'Fashion', '10')

    public function ubahData($id)
    {
        $barang = $this->barangModel->find($id);
        // var_dump($barang);

        $rule = '';
        $barang = $this->barangModel->find($id);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '2'