app/Controllers/Login.php

    public function login()
    {
        //validasi email dan password

        if (!$this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Email tidak boleh kosong',
                    'valid_email' => 'Harap isi dengan email yang valid'
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Password tidak boleh kosong',
                ]
            ]
        ])) {

            return redirect()->back()->withInput();
        }

        //deklarasi model user
        $userModel = new UserModel();

        //temukan user yang sesuai di dalam database berdasarkan email user
        $user = $userModel->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1